Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G39A.tmx
Source language: en_us
Languages: zh_cn

source: Oscar Peterson: Piano Master
zh_cn: 奥斯卡彼得森——钢琴之王

source: Famed jazz pianist Oscar Peterson commanded the entire keyboard with incredible dexterity, drive and precision.
zh_cn: 著名的爵士钢琴家奥斯卡彼得森以他不可思议的敏捷和技巧驾驭着整个键盘。

source: He performed around the world for more than 50 years, accruing countless honors, awards and critical accolades.
zh_cn: 到目前为止，他已经活跃在国际舞台上超过50年了，获得了不计其数的奖项，荣誉和乐评家如潮水般的好评。

source: Though he would have been a success by any measure, Peterson always set his own high standards, and always fulfilled them.
zh_cn: 不管从哪种标准来说，他都已经算是一个成功人物，尽管如此，彼得森总是为自己设定着高标准，并且努力实现它。

source: Peterson grew up in a poor neighborhood, in multi-ethnic southwest Montreal.
zh_cn: 彼得森成长在位于蒙特利尔西南部多种族聚集地的一个贫穷家庭。

source: His father saw musical training as an avenue towards greater opportunity for his children, an idea validated by young Oscar's tireless determination as a student.
zh_cn: 小奥斯卡学生时期坚定的决心，使得他的父亲将音乐教育视为子女们通往巨大成功与机遇的道路。

source: Peterson's teacher, Paul de Marky, taught Peterson in the Western classical tradition, while also fostering an interest in jazz.
zh_cn: 虽然彼得森的老师保尔劳伟基用西方古典的传统教授彼得森，但也培育了 彼得森对爵士乐的浓烈兴趣。

source: At age 14, Peterson won a talent contest that led to regular appearances on Canada's national radio network, the CBC.
zh_cn: 在14岁那年，彼得森赢得了通往加拿大广播公司（CBC）定期演出的一场才艺大赛。

source: Gradually, word of the young sensation began to spread throughout the jazz world.
zh_cn: 渐渐地，关于这位年轻的爵士才子的好评开始散布在爵士界。

source: Though he received offers to join the bands of Count Basie and Jimmie Lunceford, Peterson declined due to his young age.
zh_cn: 尽管他收到贝西公爵乐队和吉米·路瑟福特的邀请，彼得森还是因为太年轻的缘故拒绝了。

source: In 1949, Oscar finally made his U.S. debut at the invitation of Norman Granz, who led a touring company of all-star jazz musicians called Jazz at the Philharmonic (JATP).
zh_cn: 1949年．奥斯卡在著名制作人诺曼·格兰兹的邀请下，终于成功举办了他在美国的处女秀。诺曼·格兰兹领导了J.A.T.P(爵士走进爱乐厅)---全明星爵士巡回演出。

source: Granz heard one of Peterson's live radio broadcasts while in a Montreal taxi, and was so impressed that he immediately asked the driver to turn around and went to meet Peterson in person.
zh_cn: 据说，格兰兹在蒙特利尔的出租车广播里听到了彼得森的一次直播表演，他被彼得森的表演深深地吸引，当即请求司机掉头前往彼得森的住所会面。

source: Before long, Peterson was featured at Carnegie Hall with JATP.
zh_cn: 不久之后，彼得森和演出团出现在卡耐基音乐厅。

source: On tour, Peterson and bassist Ray Brown made up the JATP rhythm section, accompanying famous soloists such as Dizzy Gillespie, Coleman Hawkins andLester Young.
zh_cn: 在巡演中，彼得森与贝斯手雷布朗成立了J.A.T.P节奏组，一同加入的还有著名的演奏家迪兹·吉莱斯皮，柯曼霍金斯，以及李斯特杨。

source: In 1952, Granz suggested that the Peterson and Brown form a trio and tour on their own.
zh_cn: 1952年，格兰兹提议让彼得森与布朗建立一个三重奏乐队并开展属于自己的巡演。

source: Peterson approached guitarist Herb Ellis, and the die was cast for one of the most productive periods in the pianist's career.
zh_cn: 彼得森说服吉他手艾利斯加入他们，至此这位钢琴家艺术生涯中最多产的辉煌时期已渐露雏形。

source: From the start, the trio was more than just a pianist with guitar and bass as accompaniment.
zh_cn: 一开始，这个三重奏乐队不过只是带有以吉他与贝斯伴奏的钢琴演奏形式。

source: Peterson insisted that the three musicians play as one, and his ambitious musical ideas required complex arrangements and rigorous rehearsals.
zh_cn: 彼得森坚持努力让三人的演奏融合为一体，而他过于雄心壮志般的音乐理念正需要复杂的编曲和严格的训练。

source: The result was a remarkably cohesive ensemble whose members seemed to have telepathic powers of communication.
zh_cn: 最终展现在我们眼前的是非同寻常地连贯流畅的整体效果，仿佛成员之间拥有神奇的心灵沟通之术。

source: Peterson's original trio is regarded by many as the best of its kind ever to assemble.
zh_cn: 彼得森所带领的独特的三重奏一直被许多人视为有史以来最好的三重奏乐队。

source: Eventually, the hard-swinging Ellis left the group, and Peterson charted a new course by adding drummer Ed Thigpen.
zh_cn: 最终，艾利斯离开了他的团队，取而代之的是彼得森新物色的鼓手艾德。

source: The lineup change also gave him a chance to explore new harmonic textures on the piano.
zh_cn: 乐队阵容的改变给彼得森提供了一个探索键盘上全新的和声结构的良机。

source: The new trio carried on until the mid-'60s, living up to the same standards of excellence Peterson had set for his first band.
zh_cn: 新的三重奏组合一直持续到了六十年代中期，与彼得森创立的第一个乐队相比并不逊色。

source: After Brown and Thigpen left the group, Peterson eventually revived his trio with new musicians.
zh_cn: 在布朗与艾德相继离开之后，彼得森起用新人，最终重新振作了乐队。

source: He also used the opportunity to record a series of solo albums displaying an entirely new side of his talent.
zh_cn: 彼得森还利用机会灌录了一系列的独奏唱片，展现了他全方位的音乐才华。

source: Around the same time, Peterson began concentrating more on teaching and composing.
zh_cn: 于此同时，彼得森开始更专注于音乐教学与创作。

source: In 1958, Peterson had joined Brown, Thigpen and clarinetist Phil Nimmons to open the Advanced School of Contemporary Music ¡ª Canada's first school for jazz musicians.
zh_cn: 1958年，彼得森与布朗，艾德以及单簧管手菲尔尼蒙斯创办了出于时代前沿的现代音乐学院---加拿大第一所为爵士音乐家开办的音乐院校。

source: Peterson dedicated more and more time to the school as the '60s progressed. Though the school eventually closed, Peterson continued to instruct at the university level in Toronto.
zh_cn: 60年代期间，彼得森奉献了越来越多的时间在这所学校上，虽然学校最终不得不关闭，彼得森仍继续在多伦多的大学教授。

source: Peterson's commitment to excellence continued unabated.
zh_cn: 彼得森的大师神话依旧没有衰退。

source: He received Grammy Awards for Best Jazz Performance in 1975, '77, '78, and '80.
zh_cn: 他在1975年，1977年，1978年以及1990年四度获得格莱美最佳爵士演奏奖。

source: In 1990, he reunited the original trio with Ellis and Brown, and the recording of their reunion performance at the Blue Note in New York City won two more Grammys.
zh_cn: 1990年，他与原先的艾利斯和布朗重组了三重奏乐队，随后乐队在纽约蓝调之音俱乐部的演出为再度他们获得了两项格莱美奖。

source: In 1993, Peterson was performing at the Blue Note when he realized something was terribly wrong. He sensed a loss of control over the left side of his body, including his amazingly dexterous left hand.
zh_cn: 1993年，当彼得森在蓝调之音的一次演出过程中，他突然有种一种强烈的感觉：他失去了左半边肢体的控制，包括他那只令人敬畏的灵巧的左手。

source: Incredibly, he finished his set without anyone knowing that he had suffered a stroke.
zh_cn: 在众人难以置信的眼光中，他结束了他的演奏，没有人知道他正饱受中风的痛苦。

source: Peterson eventually recovered, and though he lost some facility in his left hand, he decided to continue performing.
zh_cn: 彼得森最终从病魔中康复痊愈。虽然他失去了左手的功能，他仍然决定继续表演。

source: He harbored no anger about the stroke: "As long as I can fulfill my own requirements ...
zh_cn: 彼得森并没有因为中风怨天尤人，他说道：“只要我能够满足我自己的要求......

source: I am going to keep playing," he said.
zh_cn: 我就会继续演奏”。

source: Peterson continued to perform and record until he died of kidney failure in late 2007.
zh_cn: 他始终坚持演奏到他生命的最后一刻---2007年，彼得森因肾功能衰竭而去世。
